Stevelshgh/gdk3sdk1217/src/GeHid/USB_Device/ch32f10x_usbfs_device copy.c
    intflag = R8_USB_INT_FG;
    intst = R8_USB_INT_ST;

    AsyncPrintf("intflag:%x instst:%x\r\n",intflag,intst);

    if( intflag & RB_UIF_TRANSFER )
    {
        AsyncPrintf(">RB_UIF_TRANSFER:%x\r\n",RB_UIF_TRANSFER);
        switch ( intst & MASK_UIS_TOKEN )
        {
            /* data-in stage processing */
            case UIS_TOKEN_IN:
                AsyncPrintf(">>UIS_TOKEN_IN:%x\r\n",UIS_TOKEN_IN);
                switch ( intst & ( MASK_UIS_TOKEN | MASK_UIS_ENDP ) )
                {
                    /* end-point 0 data in interrupt */
                    case UIS_TOKEN_IN | DEF_UEP0:
                        AsyncPrintf(">>>UIS_TOKEN_IN | DEF_UEP0:USBHD_SetupReqLen(%x),USBHD_SetupReqCode(%x)\r\n",USBHD_SetupReqLen,USBHD_SetupReqCode);
                        if( USBHD_SetupReqLen == 0 )
                        {
                            R8_UEP0_CTRL = (R8_UEP0_CTRL & ~MASK_UEP_R_RES ) | UEP_R_RES_ACK;
                        }
                        if ( ( USBHD_SetupReqType & USB_REQ_TYP_MASK ) != USB_REQ_TYP_STANDARD )
                        {
                            /* Non-standard request endpoint 0 Data upload */
                        }
                        else
                        {
                            switch( USBHD_SetupReqCode )
                            {
                                case USB_GET_DESCRIPTOR:
                                        len = USBHD_SetupReqLen >= DEF_USBD_UEP0_SIZE ? DEF_USBD_UEP0_SIZE : USBHD_SetupReqLen;
                                        memcpy( USBHD_EP0_Buf, pUSBHD_Descr, len );
                                        USBHD_SetupReqLen -= len;
                                        pUSBHD_Descr += len;
                                        R8_UEP0_T_LEN   = len;
                                        R8_UEP0_CTRL ^= RB_UEP_T_TOG;
                                        break;

                                case USB_SET_ADDRESS:
                                        R8_USB_DEV_AD = ( R8_USB_DEV_AD & RB_UDA_GP_BIT ) | USBHD_DevAddr;
                                        break;

                                default:
                                        break;
                            }
                        }
                        break;

                        /* end-point 1 data in interrupt */
                        case UIS_TOKEN_IN | DEF_UEP1:
                            R8_UEP1_CTRL = (R8_UEP1_CTRL & ~MASK_UEP_T_RES) | UEP_T_RES_NAK;
                            R8_UEP1_CTRL ^= RB_UEP_T_TOG;
                            USBHD_Endp_Busy[ DEF_UEP1 ] = 0;
                            break;

                        /* end-point 2 data in interrupt */
                        case UIS_TOKEN_IN | DEF_UEP2:
                            R8_UEP2_CTRL = (R8_UEP2_CTRL & ~MASK_UEP_T_RES) | UEP_T_RES_NAK;
                            R8_UEP2_CTRL ^= RB_UEP_T_TOG;
                            USBHD_Endp_Busy[ DEF_UEP2 ] = 0;
                            //Uart.USB_Up_IngFlag = 0x00;
                            break;

                    default :
                        break;
                }
                break;

            /* data-out stage processing */
            case UIS_TOKEN_OUT:
                AsyncPrintf(">>UIS_TOKEN_OUT:%x\r\n",UIS_TOKEN_OUT);
                switch ( intst & ( MASK_UIS_TOKEN | MASK_UIS_ENDP ) )
                {
                    /* end-point 0 data out interrupt */
                    case UIS_TOKEN_OUT | DEF_UEP0:
                        len = R8_USB_RX_LEN;
                        if ( intst & RB_UIS_TOG_OK )
                        {
                            AsyncPrintf(">>>UIS_TOKEN_OUT | DEF_UEP0:RB_UIS_TOG_OK(%x) len(%x)\r\n",RB_UIS_TOG_OK,len);
                            if ( ( USBHD_SetupReqType & USB_REQ_TYP_MASK ) != USB_REQ_TYP_STANDARD )
                            {
                                /* Non-standard request end-point 0 Data download */
                                USBHD_SetupReqLen = 0;
                                /* Non-standard request end-point 0 Data download */

                                if (( USBHD_SetupReqType & USB_REQ_TYP_MASK ) == USB_REQ_TYP_CLASS)
                                {
                                    switch( USBHD_SetupReqCode )
                                    {
                                        case HID_SET_REPORT:
                                            memcpy(&HID_Report_Buffer[0],USBHD_EP0_Buf,DEF_USBD_FS_PACK_SIZE);
                                            HID_Set_Report_Flag = SET_REPORT_WAIT_DEAL;
                                            R8_UEP0_CTRL = ( R8_UEP0_CTRL & ~MASK_UEP_T_RES ) | UEP_T_RES_NAK;
                                            break;
                                        default:
                                            break;
                                    }
                                }

                            }
                            else
                            {
                                /* Standard request end-point 0 Data download */
                                /* Add your code here */
                            }
                            if( USBHD_SetupReqLen == 0 )
                            {
                                R8_UEP0_T_LEN = 0;
                                R8_UEP0_CTRL = (R8_UEP0_CTRL & ~MASK_UEP_T_RES) | UEP_T_RES_ACK | RB_UEP_T_TOG;
                            }
                        }
                        break;

                    /* end-point 1 data out interrupt */
                    case UIS_TOKEN_OUT | DEF_UEP2:
                        R8_UEP2_CTRL ^= RB_UEP_R_TOG;
                        break;

                    default:
                        break;
                }
                break;

            /* Setup stage processing */
            case UIS_TOKEN_SETUP:
                AsyncPrintf(">>UIS_TOKEN_SETUP:%x\r\n",UIS_TOKEN_SETUP);
                R8_UEP0_CTRL = RB_UEP_R_TOG | RB_UEP_T_TOG | UEP_R_RES_NAK | UEP_T_RES_NAK;
                /* Store All Setup Values */
                USBHD_SetupReqType  = pUSBHD_SetupReqPak->bRequestType;
                USBHD_SetupReqCode  = pUSBHD_SetupReqPak->bRequest;
                USBHD_SetupReqLen   = pUSBHD_SetupReqPak->wLength;
                USBHD_SetupReqValue = pUSBHD_SetupReqPak->wValue;
                USBHD_SetupReqIndex = pUSBHD_SetupReqPak->wIndex;

                AsyncPrintf(">>>UIS_TOKEN_SETUP:ReqType:%x,ReqCode:%x,ReqLen:%x,ReqValue:%x,ReqIndex:%x\r\n",USBHD_SetupReqType,USBHD_SetupReqCode,USBHD_SetupReqLen,USBHD_SetupReqValue,USBHD_SetupReqIndex);

                len = 0;
                errflag = 0;
                if ( ( USBHD_SetupReqType & USB_REQ_TYP_MASK ) != USB_REQ_TYP_STANDARD )
                {
                    /* usb non-standard request processing */
                    /* errflag = 0xFF; if this request or cmd dose not support */
                    /* usb non-standard request processing */
                    #if 0
                       if( USBHD_SetupReqType & USB_REQ_TYP_CLASS )
                       {
                           /* Class requests */
                           switch( USBHD_SetupReqCode )
                           {
                               case CDC_GET_LINE_CODING:
                                   pUSBHD_Descr = (uint8_t *)&Uart.Com_Cfg[ 0 ];
                                   len = 7;
                                   break;

                               case CDC_SET_LINE_CODING:
                                   break;

                               case CDC_SET_LINE_CTLSTE:
                                   break;

