Stevelshgh/gdk3sdk1217/src/GeHid/USB_Device/ch32f10x_usbfs_device copy.c
                               case CDC_SEND_BREAK:
                                   break;

                               default:
                                   errflag = 0xff;
                                   break;
                           }
                       }
                       else if( USBHD_SetupReqType & USB_REQ_TYP_VENDOR )
                       {
                           /* Manufacturer request */
                       }
                       else
                       {
                           errflag = 0xFF;
                       }

                       /* Copy Descriptors to Endp0 DMA buffer */
                       len = (USBHD_SetupReqLen >= DEF_USBD_UEP0_SIZE) ? DEF_USBD_UEP0_SIZE : USBHD_SetupReqLen;
                       memcpy( USBHD_EP0_Buf, pUSBHD_Descr, len );
                       pUSBHD_Descr += len;
                    #endif

                    if (( USBHD_SetupReqType & USB_REQ_TYP_MASK ) == USB_REQ_TYP_CLASS)
                    {
                        switch( USBHD_SetupReqCode )
                        {
                            case HID_SET_REPORT:
                                break;

                            case HID_GET_REPORT:
                                if( USBHD_SetupReqIndex == 0x00 )
                                {
                                    len = DEF_USBD_UEP0_SIZE;
                                    memcpy(USBHD_EP0_Buf,&HID_Report_Buffer[0],DEF_USBD_UEP0_SIZE);
                                }
                                else
                                {
                                    errflag = 0xFF;
                                }
                                break;

                            case HID_SET_IDLE:
                                if( USBHD_SetupReqIndex == 0x00 )
                                {
                                    USBHD_HidIdle = USBHD_EP0_Buf[ 3 ];
                                }
                                else
                                {
                                    errflag = 0xFF;
                                }
                                break;

                            case HID_SET_PROTOCOL:
                                if( USBHD_SetupReqIndex == 0x00 )
                                {
                                    USBHD_HidProtocol = USBHD_EP0_Buf[ 2 ];
                                }
                                else
                                {
                                    errflag = 0xFF;
                                }
                                break;

                            case HID_GET_IDLE:
                                if( USBHD_SetupReqIndex == 0x00 )
                                {
                                    USBHD_EP0_Buf[ 0 ] = USBHD_HidIdle;
                                    len = 1;
                                }
                                else
                                {
                                    errflag = 0xFF;
                                }
                                break;
                            case HID_GET_PROTOCOL:
                                if( USBHD_SetupReqIndex == 0x00 )
                                {
                                    USBHD_EP0_Buf[ 0 ] = USBHD_HidProtocol;
                                    len = 1;
                                }
                                else
                                {
                                    errflag = 0xFF;
                                }
                                break;
                            default:
                                errflag = 0xFF;
                                break;
                        }
                    }

                }
                else
                {
                    /* usb standard request processing */
                    switch( USBHD_SetupReqCode )
                    {
                        /* get device/configuration/string/report/... descriptors */
                        case USB_GET_DESCRIPTOR:
                            AsyncPrintf(">>>>USB_GET_DESCRIPTOR:%x\r\n",USB_GET_DESCRIPTOR);
                            switch( (uint8_t)( USBHD_SetupReqValue >> 8 ) )
                            {
                                /* get usb device descriptor */
                                case USB_DESCR_TYP_DEVICE:
                                    pUSBHD_Descr = MyDevDescr;
                                    len = DEF_USBD_DEVICE_DESC_LEN;
                                    break;

                                /* get usb configuration descriptor */
                                case USB_DESCR_TYP_CONFIG:
                                    pUSBHD_Descr = MyCfgDescr;
                                    len = DEF_USBD_CONFIG_DESC_LEN;
                                    break;

                               /* get usb hid descriptor */
                                case USB_DESCR_TYP_HID:
                                    if( USBHD_SetupReqIndex == 0x00 )
                                    {
                                        pUSBHD_Descr = &MyCfgDescr[ 18 ];
                                        len = 9;
                                    }
                                    else if( USBHD_SetupReqIndex == 0x01 )
                                    {
                                        //pUSBHD_Descr = &MyCfgDescr[ 43 ];
                                        //len = 9;
                                    }
                                    else
                                    {
                                        errflag = 0xFF;
                                    }
                                    break;

                                /* get usb report descriptor */
                                case USB_DESCR_TYP_REPORT:
                                    if( USBHD_SetupReqIndex == 0x00 )
                                    {
                                        pUSBHD_Descr = MyHIDReportDesc;
                                        len = sizeof(MyHIDReportDesc);
                                    }
                                    else if( USBHD_SetupReqIndex == 0x01 )
                                    {
                                        //pUSBHD_Descr = MouseRepDesc;
                                        //len = DEF_USBD_REPORT_DESC_LEN_MS;
                                    }
                                    else
                                    {
                                        errflag = 0xFF;
                                    }
                                    break;

